ТОИР_демо/src/Catalogs/торо_ВариантыАнализаПоказателейKPI/торо_ВариантыАнализаПоказателейKPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_ВариантыАнализаПоказателейKPI</name>
  <owners>Catalog.торо_ПоказателиKPI</owners>
  <attributes>
    <name>ТипАнализа</name>
    <type>
      <types>EnumRef.торо_ТипыАнализа</types>
    </type>
  </attributes>
  <attributes>
    <name>АгрегацияДанных</name>
    <type>
      <types>EnumRef.торо_АгрегацияДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыбратьСортировку</name>
    <type>
      <types>EnumRef.торо_ВариантыСортировки</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВыбираемыхЭлементов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыполнитьНормализацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкруглениеДробнойЧасти</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВариантОтображенияПоУмолчанию</name>
    <type>
      <types>EnumRef.торо_ВариантыОтображенияВариантовАнализа</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДиаграммы</name>
    <type>
      <types>EnumRef.торо_ТипыДиаграммПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАнализа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИДПоставляемойМодели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьНулевыеЗначения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

ТОИР_демо/src/Enums/торо_ВариантыСортировки/торо_ВариантыСортировки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВариантыСортировки</name>
  <enumValues>
    <name>НеИспользуется</name>
  </enumValues>
  <enumValues>
    <name>Лучшие</name>
  </enumValues>
  <enumValues>
    <name>Худшие</name>
  </enumValues>
  <enumValues>
    <name>ПоВозрастанию</name>
  </enumValues>
  <enumValues>
    <name>ПоУбыванию</name>
  </enumValues>
</mdclass:Enum>

ТОИР_демо/src/Enums/торо_ВариантыОтображенияВариантовАнализа/торо_ВариантыОтображенияВариантовАнализа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ВариантыОтображенияВариантовАнализа</name>
  <enumValues>
    <name>Кратко</name>
  </enumValues>
  <enumValues>
    <name>Диаграмма</name>
  </enumValues>
  <enumValues>
    <name>Таблица</name>
  </enumValues>
</mdclass:Enum>

ТОИР_демо/src/Enums/торо_ТипыАнализа/торо_ТипыАнализа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_ТипыАнализа</name>
  <enumValues>
    <name>ДинамикаИзменения</name>
  </enumValues>
  <enumValues>
    <name>ПокомпонентноеСравнениеСтруктура</name>
  </enumValues>
  <enumValues>
    <name>ПокомпонентноеСравнениеДинамика</name>
  </enumValues>
  <enumValues>
    <name>СравнениеСПрошлымПериодом</name>
  </enumValues>
  <enumValues>
    <name>ИзмерениеТекущегоСостояния</name>
  </enumValues>
</mdclass:Enum>

ТОИР_демо/src/Enums/торо_АгрегацияДанных/торо_АгрегацияДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>торо_АгрегацияДанных</name>
  <enumValues>
    <name>НеИспользуется</name>
  </enumValues>
  <enumValues>
    <name>Минимум</name>
  </enumValues>
  <enumValues>
    <name>Максимум</name>
  </enumValues>
  <enumValues>
    <name>Среднее</name>
  </enumValues>
  <enumValues>
    <name>Сумма</name>
  </enumValues>
</mdclass:Enum>

ТОИР_демо/src/Catalogs/торо_ВариантыАнализаПоказателейKPI/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗначениеВДанныеФормы(торо_ПоказателиKPI.ПолучитьТаблицуСоответствиТиповАнализаИТиповДиаграмм(), СоответствиеТиповСравненияИТиповДиаграмм);
	ЗаполнитьСписокВыбораЗначенияИОбъектаАнализа();
	ЗаполнитьТаблицуДоступныхАгрегаций();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьОграничениеТипаДиаграммы();
	УстановитьОграничениеВариантаОтображения();
	УстановитьОграничениеАгрегацииДанных();
	УстановитьОграничениеСортировки();
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	ЗаполнитьСписокВыбораЗначенияИОбъектаАнализа();
	
	ПроверитьДопустимостьАгрегацииДанных();
	УстановитьОграничениеАгрегацииДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ТипАнализаПриИзменении(Элемент)
	
	ПроверитьДопустимостьТипаДиаграммы();
	УстановитьОграничениеТипаДиаграммы();
	
   ПроверитьДопустимостьВариантаОтображения();
	УстановитьОграничениеВариантаОтображения();
	
	ПроверитьДопустимостьАгрегацииДанных();
	УстановитьОграничениеАгрегацииДанных();
	
	ПроверитьДопустимостьСортировки();
	УстановитьОграничениеСортировки();
	
	УстановитьВидимостьДоступностьЭлементовФормыПоТипуАнализа();
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьСортировкуПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантОтображенияПоУмолчаниюПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеАнализаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ДоступныеЗначенияАнализа;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеФормой()
	
	Элементы.КоличествоВыбираемыхЭлементов.Видимость = (Объект.ВыбратьСортировку = ПредопределенноеЗначение("Перечисление.торо_ВариантыСортировки.Лучшие")
																	ИЛИ Объект.ВыбратьСортировку = ПредопределенноеЗначение("Перечисление.торо_ВариантыСортировки.Худшие"));
																	
	Элементы.ТипДиаграммы.Видимость = (Объект.ВариантОтображенияПоУмолчанию = ПредопределенноеЗначение("Перечисление.торо_ВариантыОтображенияВариантовАнализа.Диаграмма"));
	
	ТипАнализаСПериодами = (Объект.ТипАнализа = ПредопределенноеЗначение("Перечисление.торо_ТипыАнализа.ДинамикаИзменения") 
									ИЛИ Объект.ТипАнализа = ПредопределенноеЗначение("Перечисление.торо_ТипыАнализа.ПокомпонентноеСравнениеДинамика"));
	
	Элементы.ОтображатьНулевыеЗначения.Видимость = (Объект.ВариантОтображенияПоУмолчанию = ПредопределенноеЗначение("Перечисление.торо_ВариантыОтображенияВариантовАнализа.Диаграмма")
																	И ТипАнализаСПериодами);
																	
	УстановитьВидимостьДоступностьЭлементовФормыПоТипуАнализа();
	
КонецПроцедуры

&НаКлиенте 
Процедура УстановитьВидимостьДоступностьЭлементовФормыПоТипуАнализа()
	
	НастройкиПоТипуАнализа = НастройкиПоТипуАнализа(Объект, ЭтаФорма.СоответствиеТиповСравненияИТиповДиаграмм);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДопустимостьТипаДиаграммы()
	
	Если ЗначениеЗаполнено(Объект.ТипДиаграммы) Тогда
		МассивДопустимыхЗначений = ПолучитьРазрешенныеТипыДиаграммы();
		Если МассивДопустимыхЗначений.Найти(Объект.ТипДиаграммы) = Неопределено Тогда
			Объект.ТипДиаграммы = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОграничениеТипаДиаграммы()
	
	МассивДопустимыхЗначений = ПолучитьРазрешенныеТипыДиаграммы();
	масПараметрыВыбора = Новый Массив;
	масПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивДопустимыхЗначений)));
	Элементы.ТипДиаграммы.ПараметрыВыбора = Новый ФиксированныйМассив(масПараметрыВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДопустимостьВариантаОтображения()
	
	Если ЗначениеЗаполнено(Объект.ВариантОтображенияПоУмолчанию) Тогда
		МассивДопустимыхЗначений = ПолучитьРазрешенныеВариантыОтображения();
		Если МассивДопустимыхЗначений.Найти(Объект.ВариантОтображенияПоУмолчанию) = Неопределено Тогда
			Объект.ВариантОтображенияПоУмолчанию = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОграничениеВариантаОтображения()
	
	МассивДопустимыхЗначений = ПолучитьРазрешенныеВариантыОтображения();
	масПараметрыВыбора = Новый Массив;
	масПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивДопустимыхЗначений)));
	Элементы.ВариантОтображенияПоУмолчанию.ПараметрыВыбора = Новый ФиксированныйМассив(масПараметрыВыбора);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДопустимостьАгрегацииДанных()
	
	МассивДопустимыхЗначений = ПолучитьРазрешенныеАгрегации();
	Если МассивДопустимыхЗначений.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли МассивДопустимыхЗначений.Количество() = 1 Тогда
	   Объект.АгрегацияДанных = МассивДопустимыхЗначений[0];
	ИначеЕсли ЗначениеЗаполнено(Объект.АгрегацияДанных) Тогда
		Если МассивДопустимыхЗначений.Найти(Объект.АгрегацияДанных) = Неопределено Тогда
			Объект.АгрегацияДанных = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОграничениеАгрегацииДанных()
	
	МассивДопустимыхЗначений = ПолучитьРазрешенныеАгрегации();
	Если МассивДопустимыхЗначений.Количество() = 0 Тогда
		Элементы.АгрегацияДанных.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
	Иначе
		масПараметрыВыбора = Новый Массив;
		масПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивДопустимыхЗначений)));
		Элементы.АгрегацияДанных.ПараметрыВыбора = Новый ФиксированныйМассив(масПараметрыВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьДопустимостьСортировки()
	
	МассивДопустимыхЗначений = ПолучитьРазрешенныеСортировки();
	Если МассивДопустимыхЗначений.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли МассивДопустимыхЗначений.Количество() = 1 Тогда
	   Объект.ВыбратьСортировку = МассивДопустимыхЗначений[0];
		ВыбратьСортировкуПриИзменении(Элементы.ВыбратьСортировку);
	ИначеЕсли ЗначениеЗаполнено(Объект.ВыбратьСортировку) Тогда
		Если МассивДопустимыхЗначений.Найти(Объект.ВыбратьСортировку) = Неопределено Тогда
			Объект.ВыбратьСортировку = Неопределено;
			ВыбратьСортировкуПриИзменении(Элементы.ВыбратьСортировку);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОграничениеСортировки()
	
	МассивДопустимыхЗначений = ПолучитьРазрешенныеСортировки();
	Если МассивДопустимыхЗначений.Количество() = 0 Тогда
		Элементы.ВыбратьСортировку.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
	Иначе
		масПараметрыВыбора = Новый Массив;
		масПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивДопустимыхЗначений)));
		Элементы.ВыбратьСортировку.ПараметрыВыбора = Новый ФиксированныйМассив(масПараметрыВыбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокВыбораЗначенияИОбъектаАнализа()
	
	ДоступныеЗначенияАнализа.Очистить();
	ДоступныеОбъектыАнализа.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Объект.Владелец) Тогда
		Возврат;
	КонецЕсли;
	
	торо_ПоказателиKPI.ЗаполнитьДоступныеЗначенияИОбъектыАнализа(Объект.Владелец, ДоступныеЗначенияАнализа, ДоступныеОбъектыАнализа);
	
КонецПроцедуры

///////////////////////////////////////////
// Вспомогательные

&НаКлиенте
Функция ПолучитьРазрешенныеТипыДиаграммы()
	
	МассивТипов = Новый Массив;
	
	ОтборПоТипуСравнения = Новый Структура("ТипАнализа", Объект.ТипАнализа);
	НайденныеТипыДиаграмм = СоответствиеТиповСравненияИТиповДиаграмм.НайтиСтроки(ОтборПоТипуСравнения);
	
	Для Каждого ТекНайденныйТипДиаграммы Из НайденныеТипыДиаграмм Цикл 
		МассивТипов.Добавить(ТекНайденныйТипДиаграммы.ТипДиаграммы);
	КонецЦикла;
	
	Возврат МассивТипов;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста 
Функция НастройкиПоТипуАнализа(ВариантАнализа, СоответствиеТиповСравненияИТиповДиаграмм)
	
	СтруктураНастроекОформления  = Новый Структура;
	СтруктураНастроекОформления.Вставить("ТипАнализа");
	СтруктураНастроекОформления.Вставить("ТипДиаграммы");

	ОтборПоТипуАнализа = Новый Структура("ТипАнализа", ВариантАнализа.ТипАнализа);
	НайденныеНастройки = СоответствиеТиповСравненияИТиповДиаграмм.НайтиСтроки(ОтборПоТипуАнализа);
	Если НайденныеНастройки.Количество() > 0 Тогда
		ЗаполнитьЗначенияСвойств(СтруктураНастроекОформления, НайденныеНастройки[0]);
	КонецЕсли;
	
	Возврат СтруктураНастроекОформления;
	
КонецФункции

&НаКлиенте
Функция ПолучитьРазрешенныеВариантыОтображения()
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.торо_ВариантыОтображенияВариантовАнализа.Диаграмма"));
	МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.торо_ВариантыОтображенияВариантовАнализа.Таблица"));
	
	Если Объект.ТипАнализа = ПредопределенноеЗначение("Перечисление.торо_ТипыАнализа.ИзмерениеТекущегоСостояния")
		ИЛИ Объект.ТипАнализа = ПредопределенноеЗначение("Перечисление.торо_ТипыАнализа.СравнениеСПрошлымПериодом") Тогда
		МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.торо_ВариантыОтображенияВариантовАнализа.Кратко"));
	КонецЕсли;
		
	Возврат МассивТипов;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуДоступныхАгрегаций()
	
	ДоступныеАгрегацииДанных.Очистить();
	
	Макет = РеквизитФормыВЗначение("Объект").ПолучитьМакет("НастройкиАгрегации");
	ОбластьДанных = Макет.Область("Данные");
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(ОбластьДанных);
	ПостроительЗапроса.Выполнить();
	РезультатЗапроса = ПостроительЗапроса.Результат;
	ВыборкаДанных = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДанных.Следующий() Цикл
		НовСтр = ДоступныеАгрегацииДанных.Добавить();
		НовСтр.ТипПоказателя = Перечисления.торо_ТипыПоказателейKPI[ВыборкаДанных.ТипПоказателя];
		НовСтр.ТипАнализа = Перечисления.торо_ТипыАнализа[ВыборкаДанных.ТипАнализа];
		
		СписокАгрегаций = СтрРазделить(ВыборкаДанных.АгрегацияДанных, ",", Ложь);
		Для каждого НазваниеАгрегации из СписокАгрегаций Цикл
			ЗначениеАгрегации = Перечисления.торо_АгрегацияДанных[СокрЛП(НазваниеАгрегации)];
			НовСтр.АгрегацияДанных.Добавить(ЗначениеАгрегации);
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьРазрешенныеАгрегации()
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ТипПоказателя", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Владелец, "ТипПоказателя"));
	СтруктураПоиска.Вставить("ТипАнализа", Объект.ТипАнализа);
	
	СтрокаРазрешенных = ДоступныеАгрегацииДанных.НайтиСтроки(СтруктураПоиска);
	
	Если СтрокаРазрешенных.Количество() = 0 Тогда
		Возврат Новый Массив;
	Иначе
		Возврат СтрокаРазрешенных[0].АгрегацияДанных.ВыгрузитьЗначения();
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьРазрешенныеСортировки()
	
	МассивТипов = Новый Массив;
	
	Если Объект.ТипАнализа = ПредопределенноеЗначение("Перечисление.торо_ТипыАнализа.ДинамикаИзменения")
		ИЛИ Объект.ТипАнализа = ПредопределенноеЗначение("Перечисление.торо_ТипыАнализа.ИзмерениеТекущегоСостояния")
		ИЛИ Объект.ТипАнализа = ПредопределенноеЗначение("Перечисление.торо_ТипыАнализа.СравнениеСПрошлымПериодом") Тогда
		МассивТипов.Добавить(ПредопределенноеЗначение("Перечисление.торо_ВариантыСортировки.НеИспользуется"));
	КонецЕсли;
	
	Возврат МассивТипов;
	
КонецФункции


#КонецОбласти
